cfd/OpenFOAM/compressible/HiSA/01_Basic/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [1 -1 -2 0 0 0 0];

internalField uniform $pressure;


boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type        characteristicFarfieldPressure;
        U           ($flowVelocity 0 0);
        p           $pressure;
        T           $temperature;
        value       $internalField;
    }
    
    model
    {
        type        characteristicWallPressure;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
