cfd/OpenFOAM/compressible/HiSA/01_Basic/0.orig/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type        calculated;
        value       uniform 0;
    }

    model
    {
        type        boundaryCorrectedFixedValue;
        value       uniform 0;
    }

    "proc.*"
    {
        type        processor;
    }

}


// ************************************************************************* //
