cfd/OpenFOAM/compressible/HiSA/01_Basic/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [0 2 -2 0 0 0 0];

internalField uniform $turbulentKE;


boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.01; // 1% turbulence intensity
        value       $internalField;
    }

    model
    {
        type        kLowReWallFunction;
        value       uniform 1e-11;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
