cfd/OpenFOAM/compressible/HiSA/01_Basic/system/include/controlVolume
// control volume dimensions
controlVolOriginX -2;
controlVolLength   8;
controlVolWidth    4;
controlVolHeight   4;

// cell size
controlVolCellSize 0.25;