cfd/OpenFOAM/compressible/HiSA/01_Basic/system/include/geometryRefinement
// near geometry refinement
nearGeometryRefinementDistance 0.5;
nearGeometryRefinementLevel 2;

// geometry surface refinement
surfaceRefinementLevelMin 2;
surfaceRefinementLevelMax 3;

// geometry features refinement
geometryFeaturesRefinementLevel 4;
